luckyCharm1123/STM32_LED/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body 主程序主体
  * @details        : This file contains the main application code for the STM32 LED
  *                  blinking project with USART2 serial communication.
  *                  本文件包含STM32 LED闪烁和串口通信项目的主应用程序代码。
  *                  USART2 configured on PA2(TX) and PA3(RX) pins at 115200 baud.
  *                  USART2配置在PA2(TX)和PA3(RX)引脚，波特率115200。
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  * @par Project Context 项目背景
  * - MCU: STM32F103xB (ARM Cortex-M3)
  * - IDE: STM32CubeIDE / CMake
  * - Purpose: LED blinking + USART2 serial communication
  * - 目的：LED闪烁 + USART2串口通信
  * - USART2: 115200 8N1, TX=PA2, RX=PA3
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_hal_def.h"
#include <stdio.h>  // 用于printf重定向，实现标准输出到串口
#include <string.h> // 用于字符串操作，如strlen、strncmp、memset等
#include <stdlib.h> // 用于atoi函数，字符串转整数
#include <inttypes.h> // 用于PRIu32等格式化宏
#include "sht30_soft.h"  // SHT30温湿度传感器驱动（软件I2C版本）
#include "radar.h"  // 毫米波雷达驱动
#include "lora.h"  // LoRa通信模块驱动
#include "sound_sensor.h"  // 声音传感器驱动（ADC模拟输出）
#include "veml7700_soft.h"  // VEML7700环境光传感器驱动（软件I2C版本）
#include "RED_LED.h"  // 红色LED驱动（带呼吸灯效果）
#include "GREEN_LED.h"  // 绿色LED驱动（配置成功指示）

/* USER CODE BEGIN PV */
/* 用户代码开始：私有变量 */

UART_HandleTypeDef huart1;  // USART1句柄，用于调试输出（PA9/PA10，115200）
UART_HandleTypeDef huart2;  // USART2句柄，用于LoRa通信（PA2/PA3，9600/115200）
UART_HandleTypeDef huart3;  // USART3句柄，用于毫米波雷达通信（PB10/PB11，115200）
DMA_HandleTypeDef hdma_usart3_rx;  // USART3接收DMA句柄

/* 动态WiFi配置变量 */
char g_device_code[9];  // 全局设备码，8位十六进制 + 结束符
static char g_lora_mac[5] = {0};      // 保存配置后的MAC(4字符)
static char g_lora_channel[3] = {0};  // 保存配置后的CHANNEL(2字符)
static uint8_t g_lora_configured = 0;
static uint8_t g_system_initialized = 0; // 是否已完成业务初始化（配置后）
static uint8_t g_getdata_miss_count = 0; // 连续未收到getData的次数
static uint8_t g_waiting_getdata_ack = 0;  // 是否在等待本次上报对应的getData应答
static uint32_t g_last_uplink_time = 0;    // 最近一次上报成功时间
static uint32_t g_last_config_request_time = 0;  // 上次发送配置请求的时间
static uint32_t g_config_retry_interval_ms = 5000;  // 配置请求重试间隔（退避）
static uint32_t g_config_retry_jitter_ms = 0;  // 配置请求抖动，避免固定相位冲突

/* 状态发送机结构体 */
typedef struct
{
  uint8_t  send_state;       /* 发送状态 */
  uint32_t last_send_time;   /* 上次发送时间(ms) */
  uint32_t interval_ms;      /* 当前发送间隔(ms) */
  uint8_t  fast_remaining;   /* 快速模式剩余次数 */
  uint8_t  initialized;      /* 是否已初始化 */
} StateSender_t;

static StateSender_t g_state_sender = {0};
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);  // 系统时钟配置函数声明
static void MX_GPIO_Init(void); // GPIO初始化函数声明（静态函数，仅在本文件内可见）
static void MX_USART1_UART_Init(void); // USART1初始化函数声明（调试串口）
static void MX_USART2_UART_Init(void); // USART2初始化函数声明（LoRa串口）
static void MX_USART3_UART_Init(void); // USART3初始化函数声明（雷达串口）

/* USER CODE BEGIN PFP */
/* 用户代码开始：私有函数原型 */
void DEBUG_SendString(const char *str);    // USART1调试串口发送函数原型
void Get_STM32_UID(char *uid_str);         // 获取STM32芯片唯一ID
void Generate_Device_Code(char *device_code);  // 生成8位设备码
uint8_t Process_Sensor_Status(uint8_t *last_combined_state);  // 处理传感器状态并返回综合状态
void StateSender_Init(void);               // 初始化状态发送机
void StateSender_Update(void);             // 状态发送机更新
int StateSender_SendFast(void);            // 快速发送函数
int StateSender_SendNormal(void);          // 正常发送函数
void StateSender_ResetFastMode(void);      // 进入/重置快速发送模式
void LORA_ReinitAndConfig(void);           // 重新初始化LoRa并配置MAC/CHANNEL
Radar_TargetStatus_t StateSender_GetRadarStatus(void);  // 获取毫米波雷达状态
uint32_t StateSender_GetRadarPowerSum(void);            // 获取P值总值
uint32_t StateSender_GetRadarRangeSum(void);            // 获取R值总值
uint16_t StateSender_GetRadarValidCount(void);          // 获取有效次数
int StateSender_GetTempHumi(float *temp, float *humi);  // 获取温湿度
uint16_t StateSender_GetSoundLevel(void);               // 获取声音等级
static void StrToUpper(char *str);         // 字符串转大写(就地)
static void LIGHT_I2C_ScanOnBoot(void);     // 启动时扫描I2C地址
static void StateSender_ReportRelayActionOnce(void);    // 继电器动作后立即上报一次
static void LORA_RearmRxIT(void);                       // 重启LoRa串口接收中断（带容错）
static uint32_t LORA_NextConfigRetryJitterMs(void);     // 生成配置重试抖动
/**
  * @brief USART1发送调试信息
  * @param str: 要发送的调试字符串，以'\0'结尾
  * @retval None
  * @details USART1专用调试串口，配置在PA9(TX)/PA10(RX)
  *          波特率115200，用于输出系统调试信息
  */
void DEBUG_SendString(const char *str)
{
  HAL_UART_Transmit(&huart1, (uint8_t*)str, strlen(str), HAL_MAX_DELAY);
}

/**
  * @brief 字符串转大写(就地)
  * @param str: 待转换字符串
  * @retval None
  */
static void StrToUpper(char *str)
{
  if(str == NULL)
  {
    return;
  }
  while(*str)
  {
    if(*str >= 'a' && *str <= 'z')
    {
      *str = (char)(*str - ('a' - 'A'));
    }
    str++;
  }
}

/**
  * @brief 继电器动作后立即上报一次快速状态
  * @retval None
  */
static void StateSender_ReportRelayActionOnce(void)
{
  if(!g_lora_configured || !g_state_sender.initialized)
  {
    return;
  }

  (void)StateSender_SendFast();
  g_state_sender.last_send_time = HAL_GetTick();
}

/**
  * @brief 发送设备配置请求到服务器
  * @retval 0: 成功发送, -1: 发送失败
  * @details 发送 "setting" + 设备码 到服务器，请求配置MAC和CHANNEL
  */
static int Send_Config_Request(void)
{
  char device_id_data[32];
  snprintf(device_id_data, sizeof(device_id_data), "setting%s", g_device_code);

  if(LORA_SendFormattedData(device_id_data) == 0)
  {
    g_last_config_request_time = HAL_GetTick();
    g_config_retry_jitter_ms = LORA_NextConfigRetryJitterMs();
    return 0;
  }

  return -1;
}

/**
  * @brief 生成配置请求重试抖动（单位ms）
  * @retval 抖动值（200~1199ms）
  */
static uint32_t LORA_NextConfigRetryJitterMs(void)
{
  uint32_t seed = HAL_GetTick();
  for(uint8_t i = 0; i < 8 && g_device_code[i] != '\0'; i++)
  {
    seed = (seed * 33u) ^ (uint8_t)g_device_code[i];
  }
  seed = seed * 1664525u + 1013904223u;
  return 200u + (seed % 1000u);
}

/**
  * @brief 重启LoRa串口接收中断（带容错）
  * @retval None
  */
static void LORA_RearmRxIT(void)
{
  extern uint8_t lora_rx_byte;

