luckyCharm1123/STM32_LED/Core/Src/main.c
  HAL_StatusTypeDef st = HAL_UART_Receive_IT(&huart2, &lora_rx_byte, 1);
  if(st == HAL_OK || st == HAL_BUSY)
  {
    return;
  }

  __HAL_UART_CLEAR_OREFLAG(&huart2);
  __HAL_UART_CLEAR_FEFLAG(&huart2);
  __HAL_UART_CLEAR_NEFLAG(&huart2);
  __HAL_UART_CLEAR_PEFLAG(&huart2);
  (void)HAL_UART_AbortReceive(&huart2);

  for(uint8_t i = 0; i < 2; i++)
  {
    HAL_Delay(1);
    st = HAL_UART_Receive_IT(&huart2, &lora_rx_byte, 1);
    if(st == HAL_OK || st == HAL_BUSY)
    {
      return;
    }
  }
}

/**
  * @brief 启动时扫描软件I2C总线地址（PB6/PB7）
  * @note  用于快速确认VEML7700(0x10)是否真实在线
  * @note  已禁用调用和所有调试输出，避免初始化时红色LED长亮
  */
__attribute__((unused)) static void LIGHT_I2C_ScanOnBoot(void)
{
  // char msg[96];  // 已禁用调试输出
  uint8_t addr;
  uint8_t found_count = 0;
  uint8_t found_veml = 0;

  // DEBUG_SendString("[LIGHT SCAN] I2C scan start (7bit 0x08~0x77)\r\n");  // 已禁用

  for(addr = 0x08; addr <= 0x77; addr++)
  {
    if(VEML7700_ProbeAddress7bit(addr) == 0)
    {
      found_count++;
      if(addr == 0x10)
      {
        found_veml = 1;
      }

      // snprintf(msg, sizeof(msg), "[LIGHT SCAN] found: 0x%02X\r\n", addr);  // 已禁用
      // DEBUG_SendString(msg);
    }
  }

  // snprintf(msg, sizeof(msg), "[LIGHT SCAN] total devices: %u\r\n", found_count);  // 已禁用
  // DEBUG_SendString(msg);

  // if(found_veml)
  // {
  //   DEBUG_SendString("[LIGHT SCAN] VEML7700 address 0x10 detected\r\n");  // 已禁用
  // }
  // else
  // {
  //   DEBUG_SendString("[LIGHT SCAN] WARNING: 0x10 not detected\r\n");  // 已禁用
  // }

  (void)found_count;  // 避免未使用变量警告
  (void)found_veml;   // 避免未使用变量警告
}

int main(void)
{
  HAL_Init();
  SystemClock_Config();
  MX_GPIO_Init();              // 初始化GPIO
  MX_USART1_UART_Init();       // 初始化USART1（调试串口）
  MX_USART2_UART_Init();       // 初始化USART2（LoRa串口）
  MX_USART3_UART_Init();       // 初始化USART3（雷达串口）
  SHT30_Soft_Init();            // 初始化软件I2C

  /* 点亮红色LED，表示I2C扫描和光传感器初始化开始 */
  RED_LED_On();

  // LIGHT_I2C_ScanOnBoot();       // 扫描I2C总线设备
  SOUND_SENSOR_Init();          // 初始化声音传感器ADC

  /* 检测VEML7700光传感器 */
  if(VEML7700_IsConnected() == 0)
  {
    // DEBUG_SendString("[LIGHT] VEML7700 detected on I2C bus\r\n");
    if(VEML7700_Soft_Init() == 0)
    {
      // DEBUG_SendString("[LIGHT] VEML7700 initialized successfully\r\n");

      /* 读取配置寄存器验证 */
      uint16_t config_reg = 0;
      if(VEML7700_ReadReg(0x00, &config_reg) == 0)
      {
        // char conf_msg[64];
        // snprintf(conf_msg, sizeof(conf_msg), "[LIGHT] Config Reg: 0x%04X\r\n", config_reg);
        // DEBUG_SendString(conf_msg);
        (void)config_reg;  // 避免未使用变量警告
      }

      /* 读取ALS高字节寄存器 */
      uint16_t als_high = 0, als_low = 0;
      if(VEML7700_ReadReg(0x04, &als_high) == 0 && VEML7700_ReadReg(0x05, &als_low) == 0)
      {
        // char als_msg[64];
        // snprintf(als_msg, sizeof(als_msg), "[LIGHT] ALS Raw: 0x%04X 0x%04X\r\n", als_high, als_low);
        // DEBUG_SendString(als_msg);
        (void)als_high;  // 避免未使用变量警告
        (void)als_low;   // 避免未使用变量警告
      }
    }
    // else
    // {
    //   DEBUG_SendString("[LIGHT] WARNING: VEML7700 init failed\r\n");
    // }
  }
  // else
  // {
  //   DEBUG_SendString("[LIGHT] WARNING: VEML7700 not detected (check wiring)\r\n");
  // }

  /* 熄灭红色LED，表示I2C扫描和光传感器初始化完成 */
  RED_LED_Off();

  HAL_Delay(10);

  /* 初始化雷达模块 */
  if(RADAR_Init() != 0)
  {
    // DEBUG_SendString("[ERR] Radar init failed\r\n");
  }

  /* 启动红色LED呼吸灯，表示开始LoRa初始化和配置 */
  RED_LED_Breathing_Init();

  /* 初始化LoRa模块（USART2，波特率9600） */
  // DEBUG_SendString("[LORA] Initializing...\r\n");
  // DEBUG_SendString("[LORA] Step 1: Sending +++ command (waiting for 'Entry AT')...\r\n");

  /* 生成设备码（基于芯片唯一ID）- 必须在发送之前生成 */
  Generate_Device_Code(g_device_code);
  char device_msg[64];
  /* 拼接字符串 */
  snprintf(device_msg, sizeof(device_msg), "Device Code: %s\r\n", g_device_code);
  /* 发送到串口调试 */
  // DEBUG_SendString(device_msg);

  if(LORA_Init(9600) != 0)
  {
    // DEBUG_SendString("[ERR] LoRa init failed\r\n");
  }
  else
  {
    // DEBUG_SendString("[LORA] LoRa initialized successfully\r\n");

    /* LoRa初始化成功后，立即发送设备ID请求 */
    Send_Config_Request();

    /* 不再等待10秒，直接进入主循环，在主循环中处理配置响应和重试 */
    /* 如果服务器无响应，主循环会每隔3秒自动重试 */
  }

  /* 初始化状态发送机 */
  StateSender_Init();

  /* 传感器状态输出计时变量 */
  static uint32_t last_sensor_output_time = 0;
  const uint32_t sensor_output_interval = 500;  // 500ms输出一次

  /* 雷达状态变量 */
  static uint8_t last_radar_has_person = 1;  // 上次雷达状态（0=无人，1=有人），默认有人

  while (1)
  {
    /* 更新LED呼吸灯效果 */
    RED_LED_Breathing_Update();

    /* 如果LoRa未配置，检查是否需要重试发送配置请求 */
    if(!g_lora_configured)
    {
      uint32_t now = HAL_GetTick();
      extern LORA_Status_t lora_status;
      const uint32_t rx_guard_ms = 350;  // 最近收到下行后，短时间内不主动上行
      /* 距离上次请求超过当前重试间隔，重新发送（指数退避前的线性退避） */
      if((now - g_last_config_request_time) >= (g_config_retry_interval_ms + g_config_retry_jitter_ms))
      {
        if(!LORA_IsDataReady() && (now - lora_status.last_rx_time) >= rx_guard_ms)
        {
          if(Send_Config_Request() == 0)
          {
            if(g_config_retry_interval_ms < 12000)
            {
              g_config_retry_interval_ms += 1000;
            }
          }
        }
      }
    }

    /* 处理雷达数据 */
    RADAR_Process();

    /* 检查LoRa是否接收到数据 */
    if(LORA_IsDataReady())
    {
      uint8_t lora_rx_data[256];
      uint16_t lora_rx_len = LORA_GetData(lora_rx_data, sizeof(lora_rx_data));

      /* 重启UART接收中断，准备接收下一帧数据 */
      LORA_RearmRxIT();

      if(lora_rx_len > 0)
      {
        // char debug_msg[512];

        /* 打印设备ID用于调试 */
        // snprintf(debug_msg, sizeof(debug_msg),
        //          "[LORA] My Device ID: %s\r\n", g_device_code);
        // DEBUG_SendString(debug_msg);

        /* 按\r\n拆包处理 */
        char rx_str[257];
        uint16_t copy_len = (lora_rx_len < sizeof(rx_str) - 1) ? lora_rx_len : (sizeof(rx_str) - 1);
        memcpy(rx_str, lora_rx_data, copy_len);
        rx_str[copy_len] = '\0';

