luckyCharm1123/STM32_LED/Core/Src/main.c
        char *saveptr = NULL;
        uint8_t getdata_handled = 0;
        char last_line[256] = {0};
        char *line = strtok_r(rx_str, "\r\n", &saveptr);
        while(line != NULL)
        {
          if(line[0] != '\0')
          {
            /* 跳过同一批次重复行 */
            if(strcmp(line, last_line) == 0)
            {
              line = strtok_r(NULL, "\r\n", &saveptr);
              continue;
            }
            strncpy(last_line, line, sizeof(last_line) - 1);
            last_line[sizeof(last_line) - 1] = '\0';

            /* 过滤常见无关回显 */
            if(strcmp(line, "getData") == 0 || strcmp(line, "OK") == 0 || strcmp(line, "Power on") == 0)
            {
              line = strtok_r(NULL, "\r\n", &saveptr);
              continue;
            }

            /* 长度不足设备ID的直接忽略 */
            if(strlen(line) < strlen(g_device_code))
            {
              line = strtok_r(NULL, "\r\n", &saveptr);
              continue;
            }

            /* 使用ASCII字符串格式解析函数 */
            char payload[256];
            int payload_len = LORA_ParseStringPacket(
                                (uint8_t *)line, strlen(line),
                                g_device_code, payload, sizeof(payload));

            if(payload_len > 0)
            {
              /* 成功提取到负载内容 */
              // snprintf(debug_msg, sizeof(debug_msg),
              //          "[LORA RX] Command received: %s\r\n", payload);
              // DEBUG_SendString(debug_msg);

              /* 为命令比较生成大写副本，兼容RELAYOn/RELAYOff等混合大小写 */
              char payload_upper[256];
              strncpy(payload_upper, payload, sizeof(payload_upper) - 1);
              payload_upper[sizeof(payload_upper) - 1] = '\0';
              StrToUpper(payload_upper);

              /* 处理setting命令: settingMACCHANNEL */
              if(strncmp(payload_upper, "SETTING", 7) == 0)
              {
                /* 收到有效下行配置，重置重试间隔 */
                g_config_retry_interval_ms = 5000;
                g_config_retry_jitter_ms = 0;

                /* 提取setting后面的参数 */
                char *params = &payload[7];  /* 跳过"setting" */
                uint16_t params_len = strlen(params);

                // snprintf(debug_msg, sizeof(debug_msg),
                //          "[LORA] Params length: %d, Params content: %s\r\n",
                //          params_len, params);
                // DEBUG_SendString(debug_msg);

                // DEBUG_SendString("[LORA] Processing configuration command\r\n");

                /* 解析MAC和CHANNEL (格式: MAC4字符+CHANNEL2字符) */
                if(params_len >= 6)  /* 至少需要4字符MAC+2字符CHANNEL */
                {
                  /* 前面4个字符是MAC,后面2个字符是CHANNEL */
                  char mac[5];
                  char channel[3];

                  /* 提取MAC (4个字符) */
                  memcpy(mac, params, 4);
                  mac[4] = '\0';

                  /* 提取CHANNEL (2个字符) */
                  memcpy(channel, &params[4], 2);
                  channel[2] = '\0';

                  /* 打印解析结果 */
                  // snprintf(debug_msg, sizeof(debug_msg),
                  //          "[LORA] MAC: %s, CHANNEL: %s\r\n", mac, channel);
                  // DEBUG_SendString(debug_msg);

                  /* 调用LoRa MAC和CHANNEL配置函数 */
                  if(LORA_ConfigureMacAndChannel(mac, channel) == 0)
                  {
                    // DEBUG_SendString("[LORA] MAC and CHANNEL configured successfully\r\n");

                    /* 保存MAC和CHANNEL，标记已配置 */
                    memcpy(g_lora_mac, mac, sizeof(g_lora_mac));
                    memcpy(g_lora_channel, channel, sizeof(g_lora_channel));
                    g_lora_configured = 1;
                    g_getdata_miss_count = 0;
                    g_waiting_getdata_ack = 0;
                    g_config_retry_interval_ms = 5000;
                    g_config_retry_jitter_ms = 0;

                    if(!g_system_initialized)
                    {
                      RELAY_On();  /* 继电器吸合，NO导通，负载通电（默认有人状态） */
                      // DEBUG_SendString("[RELAY] Relay turned ON (NO connected, load powered)\r\n");
                      // DEBUG_SendString("[SYSTEM] Initialization Successful\r\n\r\n");
                      g_system_initialized = 1;
                    }

                    /* 停止红色LED呼吸灯，表示配置成功 */
                    RED_LED_Breathing_Stop();

                    /* 点亮绿色LED，表示系统配置成功 */
                    GREEN_LED_On();

                    /* 注意：状态发送机已在系统启动时初始化，这里无需再次初始化 */

                    /* 配置成功后发送确认消息: ok+MAC+CHANNEL+设备码 (6a6a4a前缀由发送函数自动添加) */
                    char confirm_msg[32];
                    snprintf(confirm_msg, sizeof(confirm_msg), "ok%s%s%s", mac, channel, g_device_code);

                    if(LORA_SendFormattedData(confirm_msg) == 0)
                    {
                      // DEBUG_SendString("[LORA] Configuration confirmation sent successfully\r\n");
                    }
                    else
                    {
                      // DEBUG_SendString("[LORA] ERROR: Failed to send configuration confirmation\r\n");
                    }
                  }
                  else
                  {
                    // DEBUG_SendString("[LORA] ERROR: Failed to configure MAC and CHANNEL\r\n");
                  }
                }
                else
                {
                  // DEBUG_SendString("[LORA] ERROR: Invalid params format (need MAC+CHANNEL)\r\n");
                }
              }
              /* 处理继电器命令 */
              else if(strcmp(payload_upper, "ON") == 0 ||
                      strcmp(payload_upper, "RELAYON") == 0)
              {
                if(g_lora_configured)
                {
                  RELAY_On();
                  StateSender_ReportRelayActionOnce();
                  // DEBUG_SendString("[RELAY] Turned ON via LoRa\r\n");
                }
              }
              else if(strcmp(payload_upper, "GETDATA") == 0)
              {
                /* 同一批次只处理一次getData */
                if(!getdata_handled)
                {
                  g_getdata_miss_count = 0;
                  g_waiting_getdata_ack = 0;
                  // DEBUG_SendString("[LORA] getData received, miss counter reset\r\n");

